; domain
(define (domain dntp)
  (:requirements :strips :typing :equality :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions)
  (:types
    node - object
    primary secondary - node
  )
  (:predicates
    (conn  ?x - node ?y - node)
    (close ?x - node ?y - node)
    (rem   ?x - node ?y - node)
    (full  ?x - secondary)
    (buildable ?x - node ?y - node)
    (mutable   ?x - node ?y - node)
    (le        ?x - node ?y - node)
  )

  (:action insP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (buildable ?s ?p) (not (conn ?s ?p)) (not (rem ?s ?p)) (not (full ?s)))
    :effect (and (conn ?s ?p) (not (close ?s ?p)) (full ?s)))
  (:action insS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (buildable ?s1 ?s2) (not (conn ?s1 ?s2)) (not (rem ?s1 ?s2)) (not (full ?s1)) (not (full ?s2)))
    :effect (and (conn ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2)))
  (:action delP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (conn ?s ?p) (mutable ?s ?p) (not (close ?s ?p)) (full ?s))
    :effect (and (not (conn ?s ?p)) (rem ?s ?p) (not (full ?s))))
  (:action delS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (conn ?s1 ?s2) (mutable ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2))
    :effect (and (not (conn ?s1 ?s2)) (rem ?s1 ?s2) (not (full ?s1)) (not (full ?s2))))
  (:action sw
    :parameters (?u - secondary ?v - node ?vp - node)
    :precondition (and (not (= ?u ?v)) (not (= ?u ?vp)) (not (= ?v ?vp))
      (imply (le ?u ?v)  (and (conn ?u ?v) (close ?u ?v)))
      (imply (le ?v ?u)  (and (conn ?v ?u) (close ?v ?u)))
      (imply (le ?u ?vp) (and (conn ?u ?vp) (not (close ?u ?vp))))
      (imply (le ?vp ?u) (and (conn ?vp ?u) (not (close ?vp ?u)))))
    :effect (and
      (when (le ?u ?v)  (not (close ?u ?v)))
      (when (le ?v ?u)  (not (close ?v ?u)))
      (when (le ?u ?vp) (close ?u ?vp))
      (when (le ?vp ?u) (close ?vp ?u))))
)

; problem
(define (problem disnet68n) (:domain dntp)
(:objects
	S3 S4 S5 S6 S7 S8 S9 S10 S11 S12 S13 S14 S15 S16 S17 S18 S19 S20 S21 S22 S23 S24 S25 S26 S27 S28 S29 S30 - secondary
	P31 P32 - primary
)
(:init
	(conn S3 P31)
	(conn S3 S4)
	(conn S4 S5)
	(conn S5 S6)
	(conn S6 S7)
	(conn S7 S8)
	(conn S8 S9)
	(conn S9 S10)
	(conn S10 S11)
	(conn S11 S12)
	(conn S12 S13)
	(conn S13 P32)
	(conn S14 P31)
	(conn S14 S15)
	(conn S15 S16)
	(conn S16 S17)
	(conn S17 S18)
	(conn S18 S19)
	(conn S19 S20)
	(conn S20 S21)
	(conn S21 S22)
	(conn S22 S23)
	(conn S23 S24)
	(conn S24 S25)
	(conn S25 S26)
	(conn S26 S27)
	(conn S27 P32)
	(conn S28 P31)
	(conn S28 S29)
	(conn S29 S30)
	(conn S30 P32)
	(close S3 P31)
	(close S3 S4)
	(close S4 S5)
	(close S5 S6)
	(close S6 S7)
	(close S8 S9)
	(close S9 S10)
	(close S10 S11)
	(close S11 S12)
	(close S12 S13)
	(close S13 P32)
	(close S14 P31)
	(close S14 S15)
	(close S15 S16)
	(close S16 S17)
	(close S17 S18)
	(close S18 S19)
	(close S19 S20)
	(close S20 S21)
	(close S21 S22)
	(close S22 S23)
	(close S24 S25)
	(close S25 S26)
	(close S26 S27)
	(close S27 P32)
	(close S28 P31)
	(close S28 S29)
	(close S30 P32)
	(full P31)
	(full P32)
	(buildable S11 P32)
	(buildable S12 S26)
	(buildable S14 S16)
	(buildable S15 P31)
	(buildable S15 S28)
	(buildable S20 S26)
	(buildable S21 S23)
	(buildable S22 S28)
	(buildable S25 S29)
	(buildable S27 S30)
	(mutable S11 S12)
	(mutable S14 S15)
	(mutable S15 S16)
	(mutable S20 S21)
	(mutable S22 S23)
	(mutable S25 S26)
	(mutable S26 S27)
	(mutable S28 P31)
	(mutable S28 S29)
	(mutable S30 P32)
	(le P31 P32)
	(le S3 P31)
	(le S3 P32)
	(le S3 S4)
	(le S3 S5)
	(le S3 S6)
	(le S3 S7)
	(le S3 S8)
	(le S3 S9)
	(le S3 S10)
	(le S3 S11)
	(le S3 S12)
	(le S3 S13)
	(le S3 S14)
	(le S3 S15)
	(le S3 S16)
	(le S3 S17)
	(le S3 S18)
	(le S3 S19)
	(le S3 S20)
	(le S3 S21)
	(le S3 S22)
	(le S3 S23)
	(le S3 S24)
	(le S3 S25)
	(le S3 S26)
	(le S3 S27)
	(le S3 S28)
	(le S3 S29)
	(le S3 S30)
	(le S4 P31)
	(le S4 P32)
	(le S4 S5)
	(le S4 S6)
	(le S4 S7)
	(le S4 S8)
	(le S4 S9)
	(le S4 S10)
	(le S4 S11)
	(le S4 S12)
	(le S4 S13)
	(le S4 S14)
	(le S4 S15)
	(le S4 S16)
	(le S4 S17)
	(le S4 S18)
	(le S4 S19)
	(le S4 S20)
	(le S4 S21)
	(le S4 S22)
	(le S4 S23)
	(le S4 S24)
	(le S4 S25)
	(le S4 S26)
	(le S4 S27)
	(le S4 S28)
	(le S4 S29)
	(le S4 S30)
	(le S5 P31)
	(le S5 P32)
	(le S5 S6)
	(le S5 S7)
	(le S5 S8)
	(le S5 S9)
	(le S5 S10)
	(le S5 S11)
	(le S5 S12)
	(le S5 S13)
	(le S5 S14)
	(le S5 S15)
	(le S5 S16)
	(le S5 S17)
	(le S5 S18)
	(le S5 S19)
	(le S5 S20)
	(le S5 S21)
	(le S5 S22)
	(le S5 S23)
	(le S5 S24)
	(le S5 S25)
	(le S5 S26)
	(le S5 S27)
	(le S5 S28)
	(le S5 S29)
	(le S5 S30)
	(le S6 P31)
	(le S6 P32)
	(le S6 S7)
	(le S6 S8)
	(le S6 S9)
	(le S6 S10)
	(le S6 S11)
	(le S6 S12)
	(le S6 S13)
	(le S6 S14)
	(le S6 S15)
	(le S6 S16)
	(le S6 S17)
	(le S6 S18)
	(le S6 S19)
	(le S6 S20)
	(le S6 S21)
	(le S6 S22)
	(le S6 S23)
	(le S6 S24)
	(le S6 S25)
	(le S6 S26)
	(le S6 S27)
	(le S6 S28)
	(le S6 S29)
	(le S6 S30)
	(le S7 P31)
	(le S7 P32)
	(le S7 S8)
	(le S7 S9)
	(le S7 S10)
	(le S7 S11)
	(le S7 S12)
	(le S7 S13)
	(le S7 S14)
	(le S7 S15)
	(le S7 S16)
	(le S7 S17)
	(le S7 S18)
	(le S7 S19)
	(le S7 S20)
	(le S7 S21)
	(le S7 S22)
	(le S7 S23)
	(le S7 S24)
	(le S7 S25)
	(le S7 S26)
	(le S7 S27)
	(le S7 S28)
	(le S7 S29)
	(le S7 S30)
	(le S8 P31)
	(le S8 P32)
	(le S8 S9)
	(le S8 S10)
	(le S8 S11)
	(le S8 S12)
	(le S8 S13)
	(le S8 S14)
	(le S8 S15)
	(le S8 S16)
	(le S8 S17)
	(le S8 S18)
	(le S8 S19)
	(le S8 S20)
	(le S8 S21)
	(le S8 S22)
	(le S8 S23)
	(le S8 S24)
	(le S8 S25)
	(le S8 S26)
	(le S8 S27)
	(le S8 S28)
	(le S8 S29)
	(le S8 S30)
	(le S9 P31)
	(le S9 P32)
	(le S9 S10)
	(le S9 S11)
	(le S9 S12)
	(le S9 S13)
	(le S9 S14)
	(le S9 S15)
	(le S9 S16)
	(le S9 S17)
	(le S9 S18)
	(le S9 S19)
	(le S9 S20)
	(le S9 S21)
	(le S9 S22)
	(le S9 S23)
	(le S9 S24)
	(le S9 S25)
	(le S9 S26)
	(le S9 S27)
	(le S9 S28)
	(le S9 S29)
	(le S9 S30)
	(le S10 P31)
	(le S10 P32)
	(le S10 S11)
	(le S10 S12)
	(le S10 S13)
	(le S10 S14)
	(le S10 S15)
	(le S10 S16)
	(le S10 S17)
	(le S10 S18)
	(le S10 S19)
	(le S10 S20)
	(le S10 S21)
	(le S10 S22)
	(le S10 S23)
	(le S10 S24)
	(le S10 S25)
	(le S10 S26)
	(le S10 S27)
	(le S10 S28)
	(le S10 S29)
	(le S10 S30)
	(le S11 P31)
	(le S11 P32)
	(le S11 S12)
	(le S11 S13)
	(le S11 S14)
	(le S11 S15)
	(le S11 S16)
	(le S11 S17)
	(le S11 S18)
	(le S11 S19)
	(le S11 S20)
	(le S11 S21)
	(le S11 S22)
	(le S11 S23)
	(le S11 S24)
	(le S11 S25)
	(le S11 S26)
	(le S11 S27)
	(le S11 S28)
	(le S11 S29)
	(le S11 S30)
	(le S12 P31)
	(le S12 P32)
	(le S12 S13)
	(le S12 S14)
	(le S12 S15)
	(le S12 S16)
	(le S12 S17)
	(le S12 S18)
	(le S12 S19)
	(le S12 S20)
	(le S12 S21)
	(le S12 S22)
	(le S12 S23)
	(le S12 S24)
	(le S12 S25)
	(le S12 S26)
	(le S12 S27)
	(le S12 S28)
	(le S12 S29)
	(le S12 S30)
	(le S13 P31)
	(le S13 P32)
	(le S13 S14)
	(le S13 S15)
	(le S13 S16)
	(le S13 S17)
	(le S13 S18)
	(le S13 S19)
	(le S13 S20)
	(le S13 S21)
	(le S13 S22)
	(le S13 S23)
	(le S13 S24)
	(le S13 S25)
	(le S13 S26)
	(le S13 S27)
	(le S13 S28)
	(le S13 S29)
	(le S13 S30)
	(le S14 P31)
	(le S14 P32)
	(le S14 S15)
	(le S14 S16)
	(le S14 S17)
	(le S14 S18)
	(le S14 S19)
	(le S14 S20)
	(le S14 S21)
	(le S14 S22)
	(le S14 S23)
	(le S14 S24)
	(le S14 S25)
	(le S14 S26)
	(le S14 S27)
	(le S14 S28)
	(le S14 S29)
	(le S14 S30)
	(le S15 P31)
	(le S15 P32)
	(le S15 S16)
	(le S15 S17)
	(le S15 S18)
	(le S15 S19)
	(le S15 S20)
	(le S15 S21)
	(le S15 S22)
	(le S15 S23)
	(le S15 S24)
	(le S15 S25)
	(le S15 S26)
	(le S15 S27)
	(le S15 S28)
	(le S15 S29)
	(le S15 S30)
	(le S16 P31)
	(le S16 P32)
	(le S16 S17)
	(le S16 S18)
	(le S16 S19)
	(le S16 S20)
	(le S16 S21)
	(le S16 S22)
	(le S16 S23)
	(le S16 S24)
	(le S16 S25)
	(le S16 S26)
	(le S16 S27)
	(le S16 S28)
	(le S16 S29)
	(le S16 S30)
	(le S17 P31)
	(le S17 P32)
	(le S17 S18)
	(le S17 S19)
	(le S17 S20)
	(le S17 S21)
	(le S17 S22)
	(le S17 S23)
	(le S17 S24)
	(le S17 S25)
	(le S17 S26)
	(le S17 S27)
	(le S17 S28)
	(le S17 S29)
	(le S17 S30)
	(le S18 P31)
	(le S18 P32)
	(le S18 S19)
	(le S18 S20)
	(le S18 S21)
	(le S18 S22)
	(le S18 S23)
	(le S18 S24)
	(le S18 S25)
	(le S18 S26)
	(le S18 S27)
	(le S18 S28)
	(le S18 S29)
	(le S18 S30)
	(le S19 P31)
	(le S19 P32)
	(le S19 S20)
	(le S19 S21)
	(le S19 S22)
	(le S19 S23)
	(le S19 S24)
	(le S19 S25)
	(le S19 S26)
	(le S19 S27)
	(le S19 S28)
	(le S19 S29)
	(le S19 S30)
	(le S20 P31)
	(le S20 P32)
	(le S20 S21)
	(le S20 S22)
	(le S20 S23)
	(le S20 S24)
	(le S20 S25)
	(le S20 S26)
	(le S20 S27)
	(le S20 S28)
	(le S20 S29)
	(le S20 S30)
	(le S21 P31)
	(le S21 P32)
	(le S21 S22)
	(le S21 S23)
	(le S21 S24)
	(le S21 S25)
	(le S21 S26)
	(le S21 S27)
	(le S21 S28)
	(le S21 S29)
	(le S21 S30)
	(le S22 P31)
	(le S22 P32)
	(le S22 S23)
	(le S22 S24)
	(le S22 S25)
	(le S22 S26)
	(le S22 S27)
	(le S22 S28)
	(le S22 S29)
	(le S22 S30)
	(le S23 P31)
	(le S23 P32)
	(le S23 S24)
	(le S23 S25)
	(le S23 S26)
	(le S23 S27)
	(le S23 S28)
	(le S23 S29)
	(le S23 S30)
	(le S24 P31)
	(le S24 P32)
	(le S24 S25)
	(le S24 S26)
	(le S24 S27)
	(le S24 S28)
	(le S24 S29)
	(le S24 S30)
	(le S25 P31)
	(le S25 P32)
	(le S25 S26)
	(le S25 S27)
	(le S25 S28)
	(le S25 S29)
	(le S25 S30)
	(le S26 P31)
	(le S26 P32)
	(le S26 S27)
	(le S26 S28)
	(le S26 S29)
	(le S26 S30)
	(le S27 P31)
	(le S27 P32)
	(le S27 S28)
	(le S27 S29)
	(le S27 S30)
	(le S28 P31)
	(le S28 P32)
	(le S28 S29)
	(le S28 S30)
	(le S29 P31)
	(le S29 P32)
	(le S29 S30)
	(le S30 P31)
	(le S30 P32)
)
(:goal
	(and
		(conn S3 P31)
		(conn S3 S4)
		(conn S4 S5)
		(conn S5 S6)
		(conn S6 S7)
		(conn S7 S8)
		(conn S8 S9)
		(conn S9 S10)
		(conn S10 S11)
		(conn S11 P32)
		(conn S12 S13)
		(conn S12 S26)
		(conn S13 P32)
		(conn S14 P31)
		(conn S14 S16)
		(conn S15 P31)
		(conn S15 S28)
		(conn S16 S17)
		(conn S17 S18)
		(conn S18 S19)
		(conn S19 S20)
		(conn S20 S26)
		(conn S21 S22)
		(conn S21 S23)
		(conn S22 S28)
		(conn S23 S24)
		(conn S24 S25)
		(conn S25 S29)
		(conn S27 P32)
		(conn S27 S30)
		(conn S29 S30)
		(not (conn S11 S12))
		(not (conn S14 S15))
		(not (conn S15 S16))
		(not (conn S20 S21))
		(not (conn S22 S23))
		(not (conn S25 S26))
		(not (conn S26 S27))
		(not (conn S28 P31))
		(not (conn S28 S29))
		(not (conn S30 P32))
		(close S3 P31)
		(close S3 S4)
		(close S4 S5)
		(close S5 S6)
		(close S6 S7)
		(close S8 S9)
		(close S9 S10)
		(close S10 S11)
		(close S11 P32)
		(close S12 S13)
		(close S12 S26)
		(close S13 P32)
		(close S14 P31)
		(close S14 S16)
		(close S15 P31)
		(close S15 S28)
		(close S16 S17)
		(close S17 S18)
		(close S18 S19)
		(close S20 S26)
		(close S21 S22)
		(close S22 S28)
		(close S23 S24)
		(close S24 S25)
		(close S25 S29)
		(close S27 P32)
		(close S27 S30)
		(close S29 S30)
		(not (close S7 S8))
		(not (close S19 S20))
		(not (close S21 S23))
	)
)
)

; plan
1. (inss s27 s30)
   added: (conn s27 s30) (full s27) (full s30)
   goals met: 41 of 72
2. (insp s11 p32)
   added: (conn s11 p32) (full s11)
   goals met: 42 of 72
3. (inss s14 s16)
   added: (conn s14 s16) (full s14) (full s16)
   goals met: 43 of 72
4. (inss s20 s26)
   added: (conn s20 s26) (full s20) (full s26)
   goals met: 44 of 72
5. (inss s21 s23)
   added: (conn s21 s23) (full s21) (full s23)
   goals met: 45 of 72
6. (inss s15 s28)
   added: (conn s15 s28) (full s15) (full s28)
   goals met: 46 of 72
7. (inss s25 s29)
   added: (conn s25 s29) (full s25) (full s29)
   goals met: 47 of 72
8. (sw s30 p32 s27)
   deleted: (close s30 p32)
   added: (close s27 s30)
   goals met: 48 of 72
9. (delp s30 p32)
   deleted: (conn s30 p32) (full s30)
   added: (rem s30 p32)
   goals met: 49 of 72
10. (sw s28 p31 s15)
   deleted: (close s28 p31)
   added: (close s15 s28)
   goals met: 50 of 72
11. (delp s28 p31)
   deleted: (conn s28 p31) (full s28)
   added: (rem s28 p31)
   goals met: 51 of 72
12. (inss s22 s28)
   added: (conn s22 s28) (full s22) (full s28)
   goals met: 52 of 72
13. (sw s11 s12 p32)
   deleted: (close s11 s12)
   added: (close s11 p32)
   goals met: 53 of 72
14. (sw s23 s22 s24)
   deleted: (close s22 s23)
   added: (close s23 s24)
   goals met: 54 of 72
15. (dels s22 s23)
   deleted: (conn s22 s23) (full s22) (full s23)
   added: (rem s22 s23)
   goals met: 55 of 72
16. (sw s29 s28 s25)
   deleted: (close s28 s29)
   added: (close s25 s29)
   goals met: 56 of 72
17. (dels s28 s29)
   deleted: (conn s28 s29) (full s28) (full s29)
   added: (rem s28 s29)
   goals met: 57 of 72
18. (sw s14 s15 s16)
   deleted: (close s14 s15)
   added: (close s14 s16)
   goals met: 58 of 72
19. (dels s14 s15)
   deleted: (conn s14 s15) (full s14) (full s15)
   added: (rem s14 s15)
   goals met: 59 of 72
20. (sw s26 s27 s20)
   deleted: (close s26 s27)
   added: (close s20 s26)
   goals met: 60 of 72
21. (dels s26 s27)
   deleted: (conn s26 s27) (full s26) (full s27)
   added: (rem s26 s27)
   goals met: 61 of 72
22. (inss s12 s26)
   added: (conn s12 s26) (full s12) (full s26)
   goals met: 62 of 72
23. (dels s11 s12)
   deleted: (conn s11 s12) (full s11) (full s12)
   added: (rem s11 s12)
   goals met: 63 of 72
24. (sw s26 s20 s12)
   deleted: (close s20 s26)
   added: (close s12 s26)
   goals met: 63 of 72
25. (sw s20 s19 s26)
   deleted: (close s19 s20)
   added: (close s20 s26)
   goals met: 65 of 72
26. (insp s15 p31)
   added: (conn s15 p31) (full s15)
   goals met: 66 of 72
27. (sw s15 s16 p31)
   deleted: (close s15 s16)
   added: (close s15 p31)
   goals met: 67 of 72
28. (dels s15 s16)
   deleted: (conn s15 s16) (full s15) (full s16)
   added: (rem s15 s16)
   goals met: 68 of 72
29. (sw s21 s20 s23)
   deleted: (close s20 s21)
   added: (close s21 s23)
   goals met: 67 of 72
30. (dels s20 s21)
   deleted: (conn s20 s21) (full s20) (full s21)
   added: (rem s20 s21)
   goals met: 68 of 72
31. (sw s29 s25 s30)
   deleted: (close s25 s29)
   added: (close s29 s30)
   goals met: 68 of 72
32. (sw s25 s26 s29)
   deleted: (close s25 s26)
   added: (close s25 s29)
   goals met: 69 of 72
33. (dels s25 s26)
   deleted: (conn s25 s26) (full s25) (full s26)
   added: (rem s25 s26)
   goals met: 70 of 72
34. (sw s22 s21 s28)
   deleted: (close s21 s22)
   added: (close s22 s28)
   goals met: 70 of 72
35. (sw s21 s23 s22)
   deleted: (close s21 s23)
   added: (close s21 s22)
   goals met: 72 of 72
